src/SSL.Chat2Desk/src/InformationRegisters/C2D_ЛогиОбработкиWebHook/C2D_ЛогиОбработкиWebHook.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ЛогиОбработкиWebHook</name>
  <resources>
    <name>КоличествоУспешныхОбработок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНеудачныхОбработок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ХэшПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипХука</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_ЛогиОбработкиWebHook/ManagerModule.bsl
Процедура ЗаписатьСобытиеВЛог(Соответствие, ТипЗапрос = Неопределено, успех=ложь)  экспорт
	Хэш = новый ХешированиеДанных(ХешФункция.SHA256);
	Хэш.Добавить(ЗначениеВСтрокуВнутр(Соответствие));
	СоответствиеХэш = Хэш.ХешСумма;

	
	Запись = РегистрыСведений.C2D_ЛогиОбработкиWebHook.СоздатьМенеджерЗаписи();
	Запись.ХэшПакета = СоответствиеХэш;
	запись.ТипХука = ТипЗапрос;
	Запись.Прочитать();
	Запись.ХэшПакета = СоответствиеХэш;
	запись.ТипХука = ТипЗапрос;
	Если успех Тогда
		 запись.КоличествоУспешныхОбработок = запись.КоличествоУспешныхОбработок+1;
	 Иначе
		 Запись.КоличествоНеудачныхОбработок = запись.КоличествоНеудачныхОбработок+1;
	 КонецЕсли; 
	 Запись.Записать();
КонецПроцедуры
